var data = [{
	"pId": 1,
	"pName": "黑龙江",
	"Cities": [{
		"cId": 1,
		"cName": "佳木斯市",
		"Dealers": [{
			"dName": "佳木斯佳庆汽车销售有限公司"
		}]
	}, {
		"cId": 2,
		"cName": "牡丹江市",
		"Dealers": [{
			"dName": "牡丹江市裕隆汽车销售服务有限公司"
		}]
	}, {
		"cId": 3,
		"cName": "哈尔滨市",
		"Dealers": [{
			"dName": "哈尔滨顺达汽车销售服务有限公司"
		}, {
			"dName": "哈尔滨龙汇汽车销售有限公司"
		}]
	}, {
		"cId": 4,
		"cName": "七台河市",
		"Dealers": [{
			"dName": "七台河途乐贸易有限公司"
		}]
	}, {
		"cId": 5,
		"cName": "齐齐哈尔市",
		"Dealers": [{
			"dName": "齐齐哈尔鑫万翔汽车销售有限公司"
		}]
	}, {
		"cId": 6,
		"cName": "绥化市",
		"Dealers": [{
			"dName": "绥化市恒远汽车销售有限公司"
		}]
	}, {
		"cId": 7,
		"cName": "大庆市",
		"Dealers": [{
			"dName": "大庆市盛鑫龙源汽车销售维修有限公司"
		}]
	}]
}, {
	"pId": 2,
	"pName": "吉林",
	"Cities": [{
		"cId": 8,
		"cName": "辽源市",
		"Dealers": [{
			"dName": "辽源市丰达汽贸服务有限公司"
		}]
	}, {
		"cId": 9,
		"cName": "松原市",
		"Dealers": [{
			"dName": "吉林省华通汽车贸易有限公司松原分公司"
		}]
	}, {
		"cId": 10,
		"cName": "吉林市",
		"Dealers": [{
			"dName": "吉林市东山汽车经销有限公司"
		}, {
			"dName": "吉林市荣升汽车贸易有限责任公司"
		}]
	}, {
		"cId": 11,
		"cName": "白山市",
		"Dealers": [{
			"dName": "白山市长铃汽车销售有限责任公司"
		}]
	}, {
		"cId": 12,
		"cName": "梅河口市",
		"Dealers": [{
			"dName": "梅河口市汇丰轻型汽车销售有限公司"
		}]
	}, {
		"cId": 13,
		"cName": "延边鲜族州",
		"Dealers": [{
			"dName": "延吉市东山汽车贸易有限公司"
		}]
	}, {
		"cId": 14,
		"cName": "长春市",
		"Dealers": [{
			"dName": "吉林省华通汽车贸易有限公司"
		}, {
			"dName": "长春腾盛汽车销售服务有限公司"
		}]
	}, {
		"cId": 15,
		"cName": "白城市",
		"Dealers": [{
			"dName": "白城市大众轿车销售维修有限公司"
		}]
	}, {
		"cId": 16,
		"cName": "四平市",
		"Dealers": [{
			"dName": "四平铭邦汽车销售有限公司"
		}]
	}]
}, {
	"pId": 3,
	"pName": "辽宁",
	"Cities": [{
		"cId": 17,
		"cName": "鞍山市",
		"Dealers": [{
			"dName": "鞍山米兰发展有限公司"
		}]
	}, {
		"cId": 18,
		"cName": "大连市",
		"Dealers": [{
			"dName": "大连东升汽车销售服务有限公司"
		}, {
			"dName": "大连东洲汽车销售服务有限公司"
		}, {
			"dName": "大连鸿博汽车销售服务有限公司"
		}]
	}, {
		"cId": 19,
		"cName": "盘锦市",
		"Dealers": [{
			"dName": "盘锦东宸汽车销售有限公司"
		}]
	}, {
		"cId": 20,
		"cName": "沈阳市",
		"Dealers": [{
			"dName": "辽宁牧欧汽车销售服务有限公司"
		}, {
			"dName": "沈阳瑞志达汽车销售服务有限公司"
		}, {
			"dName": "沈阳大众企业集团有限公司"
		}]
	}, {
		"cId": 21,
		"cName": "辽阳市",
		"Dealers": [{
			"dName": "辽阳凯晟汽车销售服务有限公司"
		}]
	}, {
		"cId": 22,
		"cName": "朝阳市",
		"Dealers": [{
			"dName": "朝阳市尊翔汽车销售服务有限公司"
		}]
	}, {
		"cId": 23,
		"cName": "葫芦岛市",
		"Dealers": [{
			"dName": "葫芦岛市路赛得和安汽车销售有限公司"
		}]
	}, {
		"cId": 24,
		"cName": "铁岭市",
		"Dealers": [{
			"dName": "铁岭市北方汽车贸易服务有限公司"
		}]
	}, {
		"cId": 25,
		"cName": "营口市",
		"Dealers": [{
			"dName": "营口华泰汽车销售有限公司"
		}]
	}, {
		"cId": 26,
		"cName": "阜新市",
		"Dealers": [{
			"dName": "阜新鑫澳汽车销售服务有限公司"
		}]
	}, {
		"cId": 27,
		"cName": "锦州市",
		"Dealers": [{
			"dName": "锦州金帝汽车销售服务有限公司"
		}]
	}, {
		"cId": 28,
		"cName": "抚顺市",
		"Dealers": [{
			"dName": "抚顺恒信汽车贸易有限公司"
		}]
	}, {
		"cId": 29,
		"cName": "本溪市",
		"Dealers": [{
			"dName": "本溪汇盛汽车销售服务有限公司"
		}]
	}, {
		"cId": 30,
		"cName": "丹东市",
		"Dealers": [{
			"dName": "丹东鹏程汽车贸易有限公司"
		}]
	}]
}, {
	"pId": 4,
	"pName": "河北",
	"Cities": [{
		"cId": 31,
		"cName": "石家庄市",
		"Dealers": [{
			"dName": "石家庄天和汽车贸易有限公司"
		}, {
			"dName": "石家庄广源汽车贸易有限公司"
		},{
			"dName": "石家庄国利汽车销售维修有限公司"
		}]
	}, {
		"cId": 32,
		"cName": "沧州市",
		"Dealers": [{
			"dName": "沧州市世纪通汽车销售服务有限公司"
		}, {
			"dName": "沧州市融世通汽车贸易有限公司"
		}, {
			"dName": "任丘市华北汽车销售有限公司"
		}]
	}, {
		"cId": 33,
		"cName": "邢台市",
		"Dealers": [{
			"dName": "邢台瑞鹏汽车服务有限公司"
		}, {
			"dName": "邢台佳利汽车贸易有限公司"
		}]
	}, {
		"cId": 34,
		"cName": "廊坊市",
		"Dealers": [{
			"dName": "霸州市兴业亚飞汽车服务有限公司"
		}, {
			"dName": "廊坊市瑞友汽车贸易有限公司"
		}]
	}, {
		"cId": 35,
		"cName": "保定市",
		"Dealers": [{
			"dName": "保定新星宇华长安铃木汽车销售有限公司"
		}]
	}, {
		"cId": 36,
		"cName": "邯郸市",
		"Dealers": [{
			"dName": "武安市宝翔汽车销售服务有限公司 "
		}, {
			"dName": "邯郸市辰鑫汽车销售服务有限公司"
		}, {
			"dName": "邯郸市立达汽车销售服务有限公司"
		}]
	}, {
		"cId": 37,
		"cName": "秦皇岛市",
		"Dealers": [{
			"dName": "秦皇岛机电长安铃木汽车销售服务有限公司"
		}, {
			"dName": "秦皇岛瑞通嘉禾汽车销售服务有限公司"
		}]
	}, {
		"cId": 38,
		"cName": "衡水市",
		"Dealers": [{
			"dName": "衡水通力汽车销售服务有限公司"
		}]
	}, {
		"cId": 39,
		"cName": "唐山市",
		"Dealers": [{
			"dName": "唐山京津长安铃木汽车贸易有限公司"
		}, {
			"dName": "唐山市联亚物资贸易有限公司"
		}, {
			"dName": "唐山市冀东华昌汽车销售服务有限公司第二分公司"
		}]
	}, {
		"cId": 40,
		"cName": "承德市",
		"Dealers": [{
			"dName": "承德市庞大物流仓储有限责任公司"
		}]
	}, {
		"cId": 41,
		"cName": "张家口市",
		"Dealers": [{
			"dName": "张家口阳光众达汽车贸易有限公司"
		}]
	}]
}, {
	"pId": 5,
	"pName": "北京",
	"Cities": [{
		"cId": 43,
		"cName": "北京市",
		"Dealers": [{
			"dName": "北方新兴(北京)汽车销售有限公司"
		}, {
			"dName": "北京北方新兴长安铃木汽车销售服务有限责任公司（巨山店）"
		}, {
			"dName": "北京祥路来汽车销售服务有限公司"
		}, {
			"dName": "北京新兴燕都汽车销售有限公司"
		}, {
			"dName": "北京航空华北汽车贸易有限责任公司"
		}, {
			"dName": "北京世纪群飞商贸有限责任公司"
		}, {
			"dName": "北京永驰长铃商贸有限责任公司"
		}, {
			"dName": "北京联航长铃汽车销售有限公司"
		}, {
			"dName": "北京北方新兴长安铃木汽车销售服务有限责任公司"
		}]
	}]
}, {
	"pId": 6,
	"pName": "天津市",
	"Cities": [{
		"cId": 44,
		"cName": "天津市",
		"Dealers": [{
			"dName": "天津合兴盛业汽车销售有限公司"
		}, {
			"dName": "天津市燕语津发汽车销售有限公司"
		}]
	}]
}, {
	"pId": 7,
	"pName": "山西",
	"Cities": [{
		"cId": 45,
		"cName": "吕梁市",
		"Dealers": [{
			"dName": "吕梁金运汽车贸易有限公司"
		}]
	}, {
		"cId": 46,
		"cName": "长治市",
		"Dealers": [{
			"dName": "长治市鑫海汽车销售有限公司"
		}]
	}, {
		"cId": 47,
		"cName": "忻州市",
		"Dealers": [{
			"dName": "忻州大正丰汽车维修有限公司"
		}]
	}, {
		"cId": 48,
		"cName": "运城市",
		"Dealers": [{
			"dName": "运城市通达汽车销售服务有限公司"
		}]
	}, {
		"cId": 49,
		"cName": "太原市",
		"Dealers": [{
			"dName": "山西盛隆汽车销售服务有限公司"
		}, {
			"dName": "山西友信汽车贸易有限公司"
		}]
	}, {
		"cId": 50,
		"cName": "大同市",
		"Dealers": [{
			"dName": "山西阳光家园冀东汽车连锁销售有限公司"
		}]
	}, {
		"cId": 51,
		"cName": "临汾市",
		"Dealers": [{
			"dName": "洪洞县汽车贸易公司"
		}, {
			"dName": "临汾海普瑞商贸有限公司"
		}]
	}, {
		"cId": 52,
		"cName": "晋城市",
		"Dealers": [{
			"dName": "山西机电晋城汽车销售有限公司"
		}]
	}, {
		"cId": 53,
		"cName": "晋中市",
		"Dealers": [{
			"dName": "介休市通和汽车服务有限公司"
		}]
	}, {
		"cId": 54,
		"cName": "阳泉市",
		"Dealers": [{
			"dName": "阳泉市三江工程机械设备有限公司"
		}]
	}]
}, {
	"pId": 8,
	"pName": "内蒙古",
	"Cities": [{
		"cId": 55,
		"cName": "呼和浩特市",
		"Dealers": [{
			"dName": "内蒙古利丰汽车有限公司"
		}]
	}, {
		"cId": 56,
		"cName": "乌兰浩特市",
		"Dealers": [{
			"dName": "兴安盟利丰恒泰汽车销售有限责任公司"
		}]
	}, {
		"cId": 57,
		"cName": "通辽市",
		"Dealers": [{
			"dName": "通辽市通华投资有限责任公司"
		}]
	}, {
		"cId": 58,
		"cName": "锡林浩特市",
		"Dealers": [{
			"dName": "锡林郭勒盟利丰汽车行有限公司"
		}]
	}, {
		"cId": 59,
		"cName": "海拉尔市",
		"Dealers": [{
			"dName": "呼伦贝尔市利丰汽车有限公司"
		}]
	}, {
		"cId": 60,
		"cName": "赤峰市",
		"Dealers": [{
			"dName": "赤峰市利丰汽车行有限公司"
		}]
	}, {
		"cId": 61,
		"cName": "临河市",
		"Dealers": [{
			"dName": "巴彦淖尔市利丰汽车行有限公司"
		}]
	}, {
		"cId": 62,
		"cName": "鄂尔多斯市",
		"Dealers": [{
			"dName": "鄂尔多斯市天意汽车销售有限公司"
		}]
	}]
}, {
	"pId": 9,
	"pName": "山东",
	"Cities": [{
		"cId": 63,
		"cName": "青岛市",
		"Dealers": [{
			"dName": "青岛康利捷汽车销售服务有限责任公司"
		}, {
			"dName": "青岛康安捷汽车销售服务有限公司"
		}, {
			"dName": "青岛康富捷汽车销售服务有限责任公司（胶南店）"
		}, {
			"dName": "青岛康捷汽车销售服务有限责任公司"
		}]
	}, {
		"cId": 64,
		"cName": "枣庄市",
		"Dealers": [{
			"dName": "枣庄世纪祥和商贸有限公司"
		}]
	}, {
		"cId": 65,
		"cName": "临沂市",
		"Dealers": [{
			"dName": "临沂华安汽车销售服务有限公司"
		}, {
			"dName": "临沂华成汽车销售服务有限公司"
		}]
	}, {
		"cId": 66,
		"cName": "日照市",
		"Dealers": [{
			"dName": "日照市润杰汽车贸易有限公司"
		}]
	}, {
		"cId": 67,
		"cName": "烟台市",
		"Dealers": [{
			"dName": "龙口市瑞鑫汽车销售有限公司"
		}, {
			"dName": "山东鸿运汽车交易广场有限公司"
		}]
	}, {
		"cId": 68,
		"cName": "淄博市",
		"Dealers": [{
			"dName": "淄博伟图汽车销售服务有限公司"
		}, {
			"dName": "淄博久通汽车维修服务有限公司"
		}]
	}, {
		"cId": 69,
		"cName": "聊城市",
		"Dealers": [{
			"dName": "聊城远达汽车销售服务有限公司"
		}]
	}, {
		"cId": 70,
		"cName": "德州市",
		"Dealers": [{
			"dName": "德州华润汽贸有限公司"
		}]
	}, {
		"cId": 71,
		"cName": "济南市",
		"Dealers": [{
			"dName": "济南快爱特有限公司"
		}, {
			"dName": "济南骏铃汽车服务有限公司"
		}]
	}, {
		"cId": 72,
		"cName": "潍坊市",
		"Dealers": [{
			"dName": "山东润杰集团有限公司"
		}, {
			"dName": "潍坊润德汽车贸易有限公司(二店）"
		}, {
			"dName": "青州润杰汽车贸易有限公司"
		}]
	}, {
		"cId": 73,
		"cName": "东营市",
		"Dealers": [{
			"dName": "东营市泰和汽车销售有限责任公司"
		}, {
			"dName": "东营宏远汽车销售服务有限公司"
		}]
	}, {
		"cId": 74,
		"cName": "荷泽市",
		"Dealers": [{
			"dName": "菏泽诚源汽车销售服务有限公司"
		}]
	}, {
		"cId": 75,
		"cName": "滨州市",
		"Dealers": [{
			"dName": "山东滨州市汽车物资贸易有限公司"
		}]
	}, {
		"cId": 76,
		"cName": "济宁市",
		"Dealers": [{
			"dName": "济宁世纪商贸有限公司"
		}]
	}, {
		"cId": 77,
		"cName": "威海市",
		"Dealers": [{
			"dName": "威海隆德贸易有限公司"
		}]
	}]
}, {
	"pId": 10,
	"pName": "江苏",
	"Cities": [{
		"cId": 78,
		"cName": "苏州市",
		"Dealers": [{
			"dName": "昆山豪骏汽车销售服务有限公司"
		}, {
			"dName": "苏州市都市飞梭汽车销售服务有限公司"
		}, {
			"dName": "苏州市都市飞梭汽车销售服务有限公司（二店）"
		}]
	}, {
		"cId": 79,
		"cName": "南京市",
		"Dealers": [{
			"dName": "南京福佳汽车销售服务有限公司"
		}, {
			"dName": "南京羚澳汽车贸易有限公司"
		}]
	}, {
		"cId": 80,
		"cName": "无锡市",
		"Dealers": [{
			"dName": "无锡车龙锦汽车销售服务有限公司"
		}, {
			"dName": "江阴市永兴汽车销售有限公司"
		}]
	}, {
		"cId": 81,
		"cName": "连云港",
		"Dealers": [{
			"dName": "连云港东恒汽车销售服务有限公司"
		}]
	}, {
		"cId": 82,
		"cName": "镇江市",
		"Dealers": [{
			"dName": "镇江福佳汽车贸易有限公司"
		}]
	}, {
		"cId": 83,
		"cName": "盐城市",
		"Dealers": [{
			"dName": "江苏龙杰汽车实业有限公司"
		}]
	}, {
		"cId": 84,
		"cName": "宿迁市",
		"Dealers": [{
			"dName": "宿迁市中京帝奥汽车销售有限公司"
		}]
	}, {
		"cId": 85,
		"cName": "南通市",
		"Dealers": [{
			"dName": "南通钧贺车业有限公司"
		}]
	}, {
		"cId": 86,
		"cName": "丹阳市",
		"Dealers": [{
			"dName": "丹阳京达汽车有限公司"
		}]
	}, {
		"cId": 87,
		"cName": "淮安市",
		"Dealers": [{
			"dName": "江苏金天浩航汽车销售服务有限公司"
		}]
	}, {
		"cId": 88,
		"cName": "泰州市",
		"Dealers": [{
			"dName": "泰州东方铃瑞汽车销售服务有限公司"
		}]
	}, {
		"cId": 89,
		"cName": "徐州市",
		"Dealers": [{
			"dName": "徐州亚飞徐视汽车营销有限公司"
		}]
	}, {
		"cId": 90,
		"cName": "常州市",
		"Dealers": [{
			"dName": "常州联创亚飞投资发展有限公司"
		}]
	}]
}, {
	"pId": 11,
	"pName": "安徽",
	"Cities": [{
		"cId": 91,
		"cName": "巢湖市",
		"Dealers": [{
			"dName": "巢湖市众力汽车销售服务有限公司"
		}]
	}, {
		"cId": 92,
		"cName": "马鞍山市",
		"Dealers": [{
			"dName": "马鞍山市中兴摩托车销售有限公司"
		}]
	}, {
		"cId": 93,
		"cName": "蚌埠市",
		"Dealers": [{
			"dName": "蚌埠新达汽车销售服务有限公司"
		}]
	}, {
		"cId": 94,
		"cName": "安庆市",
		"Dealers": [{
			"dName": "安庆市通银汽车销售服务有限公司"
		}]
	}, {
		"cId": 95,
		"cName": "淮北市",
		"Dealers": [{
			"dName": "淮北安奇汽车销售服务有限公司"
		}]
	}, {
		"cId": 96,
		"cName": "滁州市",
		"Dealers": [{
			"dName": "滁州市建林汽车销售有限公司"
		}]
	}, {
		"cId": 97,
		"cName": "芜湖市",
		"Dealers": [{
			"dName": "芜湖广顺汽车销售服务有限公司"
		}]
	}, {
		"cId": 98,
		"cName": "阜阳市",
		"Dealers": [{
			"dName": "阜阳市恒通汽车销售服务有限公司"
		}]
	}, {
		"cId": 99,
		"cName": "合肥市",
		"Dealers": [{
			"dName": "合肥大步车之家汽车销售服务有限公司"
		}, {
			"dName": "合肥渝皖汽车销售有限公司"
		}]
	}, {
		"cId": 100,
		"cName": "亳州市",
		"Dealers": [{
			"dName": "亳州市隆兴汽车销售有限责任公司"
		}]
	}, {
		"cId": 101,
		"cName": "六安市",
		"Dealers": [{
			"dName": "六安明峰汽车销售服务有限公司"
		}]
	}, {
		"cId": 102,
		"cName": "黄山市",
		"Dealers": [{
			"dName": "黄山市畅远汽车销售服务有限公司"
		}]
	}, {
		"cId": 103,
		"cName": "宿州市",
		"Dealers": [{
			"dName": "宿州永福汽车贸易有限公司"
		}]
	}]
}, {
	"pId": 12,
	"pName": "浙江",
	"Cities": [{
		"cId": 104,
		"cName": "宁波市",
		"Dealers": [{
			"dName": "宁波荣鑫汽车销售服务有限公司"
		}, {
			"dName": "余姚市东兴汽车销售服务有限公司"
		}, {
			"dName": "宁波市中瑞汽车销售服务有限公司"
		}]
	}, {
		"cId": 105,
		"cName": "嘉兴市",
		"Dealers": [{
			"dName": "嘉兴市中信汽车销售有限公司"
		}]
	}, {
		"cId": 106,
		"cName": "金华市",
		"Dealers": [{
			"dName": "金华市福铃汽车销售有限公司2007.05.25"
		}]
	}, {
		"cId": 107,
		"cName": "台州市",
		"Dealers": [{
			"dName": "台州祥通汽车有限公司"
		}, {
			"dName": "台州市路桥汽车销售服务有限公司"
		}]
	}, {
		"cId": 108,
		"cName": "温州市",
		"Dealers": [{
			"dName": "永嘉利达汽车有限公司"
		}, {
			"dName": "温州市铃燕汽车销售服务有限公司"
		}, {
			"dName": "瑞安市铃达汽车销售服务有限公司"
		}]
	}, {
		"cId": 109,
		"cName": "舟山市",
		"Dealers": [{
			"dName": "舟山永杰汽车销售服务有限公司"
		}]
	}, {
		"cId": 110,
		"cName": "丽水市",
		"Dealers": [{
			"dName": "丽水市万兴汽车销售有限公司"
		}]
	}, {
		"cId": 111,
		"cName": "杭州市",
		"Dealers": [{
			"dName": "杭州祥通铃木汽车有限公司"
		}]
	}, {
		"cId": 112,
		"cName": "诸暨市",
		"Dealers": [{
			"dName": "诸暨迪迈尔汽车有限公司"
		}]
	}, {
		"cId": 113,
		"cName": "衢州市",
		"Dealers": [{
			"dName": "衢州市龙腾汽车销售服务有限公司"
		}]
	}, {
		"cId": 114,
		"cName": "义乌市",
		"Dealers": [{
			"dName": "义乌迪通汽车销售有限公司"
		}]
	}]
}, {
	"pId": 13,
	"pName": "上海",
	"Cities": [{
		"cId": 115,
		"cName": "上海市",
		"Dealers": [{
			"dName": "上海弘邦汽车销售服务有限公司"
		}, {
			"dName": "上海金旋铃铃汽车销售服务有限公司"
		}, {
			"dName": "上海弘迅汽车销售服务有限公司"
		}, {
			"dName": "上海弘怡汽车销售服务有限公司"
		}, {
			"dName": "上海弘品汽车销售服务有限公司"
		}, {
			"dName": "上海铃木机动车销售有限公司"
		}]
	}]
}, {
	"pId": 14,
	"pName": "河南",
	"Cities": [{
		"cId": 116,
		"cName": "郑州市",
		"Dealers": [{
			"dName": "河南省裕华汽车集团有限公司"
		}, {
			"dName": "河南鼎芝源汽车销售有限公司"
		}, {
			"dName": "河南中植汽车销售服务有限公司"
		}]
	}, {
		"cId": 117,
		"cName": "开封市",
		"Dealers": [{
			"dName": "开封市万宝实业有限公司"
		}]
	}, {
		"cId": 118,
		"cName": "焦作市",
		"Dealers": [{
			"dName": "焦作市辂德驰汽车贸易有限公司"
		}]
	}, {
		"cId": 119,
		"cName": "洛阳市",
		"Dealers": [{
			"dName": "洛阳达飞汽车销售有限公司"
		}]
	}, {
		"cId": 120,
		"cName": "平顶山市",
		"Dealers": [{
			"dName": "平顶山市佳程汽车销售有限公司"
		}]
	}, {
		"cId": 121,
		"cName": "漯河市",
		"Dealers": [{
			"dName": "漯河宏运汽车贸易有限公司"
		}]
	}, {
		"cId": 122,
		"cName": "新乡市",
		"Dealers": [{
			"dName": "新乡市三环汽车贸易有限公司"
		}]
	}, {
		"cId": 123,
		"cName": "驻马店",
		"Dealers": [{
			"dName": "驻马店市九洲汽车贸易有限公司"
		}]
	}, {
		"cId": 124,
		"cName": "许昌市",
		"Dealers": [{
			"dName": "许昌万里长铃汽车销售服务有限公司"
		}]
	}, {
		"cId": 125,
		"cName": "三门峡市",
		"Dealers": [{
			"dName": "三门峡兴顺汽车销售服务有限公司"
		}]
	}, {
		"cId": 126,
		"cName": "南阳市",
		"Dealers": [{
			"dName": "南阳达源汽车销售有限公司"
		}]
	}, {
		"cId": 127,
		"cName": "周口市",
		"Dealers": [{
			"dName": "周口市永达汽车贸易有限公司"
		}]
	}, {
		"cId": 128,
		"cName": "济源市",
		"Dealers": [{
			"dName": "济源市恒运汽车销售服务有限公司 "
		}]
	}, {
		"cId": 129,
		"cName": "商丘市",
		"Dealers": [{
			"dName": "商丘市隆兴汽车销售有限公司（二店）"
		}, {
			"dName": "商丘市隆兴汽车销售有限公司"
		}]
	}]
}, {
	"pId": 15,
	"pName": "湖北",
	"Cities": [{
		"cId": 130,
		"cName": "襄樊市",
		"Dealers": [{
			"dName": "襄阳市桑奥汽车服务有限责任公司"
		}]
	}, {
		"cId": 131,
		"cName": "恩施州",
		"Dealers": [{
			"dName": "恩施宏源汽车销售服务有限公司"
		}]
	}, {
		"cId": 132,
		"cName": "武汉市",
		"Dealers": [{
			"dName": "武汉北方车辆有限公司"
		}]
	}, {
		"cId": 133,
		"cName": "随州市",
		"Dealers": [{
			"dName": "随州市金华汽车销售服务有限公司"
		}]
	}, {
		"cId": 134,
		"cName": "十堰市",
		"Dealers": [{
			"dName": "十堰市新长安汽车销售有限公司"
		}]
	}, {
		"cId": 135,
		"cName": "宜昌市",
		"Dealers": [{
			"dName": "宜昌市华康工贸有限责任公司"
		}]
	}, {
		"cId": 136,
		"cName": "荆州市",
		"Dealers": [{
			"dName": "荆州市众能汽车贸易有限公司"
		}]
	}]
}, {
	"pId": 16,
	"pName": "湖南",
	"Cities": [{
		"cId": 137,
		"cName": "株洲市",
		"Dealers": [{
			"dName": "株洲蓝铃汽车销售服务有限公司"
		}]
	}, {
		"cId": 138,
		"cName": "岳阳市",
		"Dealers": [{
			"dName": "湖南邦田汽车服务有限公司"
		}]
	}, {
		"cId": 139,
		"cName": "湘潭市",
		"Dealers": [{
			"dName": "湘潭正铃汽车销售有限公司"
		}]
	}, {
		"cId": 140,
		"cName": "长沙市",
		"Dealers": [{
			"dName": "长沙天潮贸易有限公司(二店)（原湖南弘泰瑞驰）"
		}, {
			"dName": "长沙天潮贸易有限公司"
		}]
	}, {
		"cId": 141,
		"cName": "衡阳市",
		"Dealers": [{
			"dName": "衡阳市裕翔汽车贸易服务有限公司"
		}]
	}, {
		"cId": 142,
		"cName": "永州市",
		"Dealers": [{
			"dName": "永州香河旺达汽车销售有限公司"
		}]
	}, {
		"cId": 143,
		"cName": "常德市",
		"Dealers": [{
			"dName": "常德市金源盛汽车贸易有限公司"
		}]
	}, {
		"cId": 144,
		"cName": "邵阳市",
		"Dealers": [{
			"dName": "邵阳市盛德汽车销售有限责任公司"
		}]
	}, {
		"cId": 145,
		"cName": "郴州市",
		"Dealers": [{
			"dName": "郴州海弘汽车销售有限公司"
		}]
	}]
}, {
	"pId": 17,
	"pName": "江西",
	"Cities": [{
		"cId": 146,
		"cName": "九江市",
		"Dealers": [{
			"dName": "九江市新恒通汽车销售有限公司"
		}]
	}, {
		"cId": 147,
		"cName": "赣州市",
		"Dealers": [{
			"dName": "赣州诚致汽车销售服务有限公司"
		}]
	}, {
		"cId": 148,
		"cName": "景德镇市",
		"Dealers": [{
			"dName": "景德镇市鹏翔汽车销售服务有限公司"
		}]
	}, {
		"cId": 149,
		"cName": "南昌市",
		"Dealers": [{
			"dName": "江西燕兴长安汽车销售有限公司"
		}]
	}, {
		"cId": 150,
		"cName": "吉安市",
		"Dealers": [{
			"dName": "吉安兰氏汽车贸易有限公司"
		}]
	}]
}, {
	"pId": 18,
	"pName": "福建",
	"Cities": [{
		"cId": 151,
		"cName": "福州市",
		"Dealers": [{
			"dName": "福州雄峰汽车维修服务有限公司"
		}, {
			"dName": "福州云驿汽车销售服务有限公司"
		}]
	}, {
		"cId": 152,
		"cName": "厦门市",
		"Dealers": [{
			"dName": "厦门铃瑞汽车销售服务有限公司"
		}, {
			"dName": "厦门中展汽车维修销售服务有限公司"
		}]
	}, {
		"cId": 153,
		"cName": "泉州市",
		"Dealers": [{
			"dName": "福建省晋江市安平雄峰车行"
		}, {
			"dName": "福建省晟邦汽车贸易有限公司"
		}]
	}, {
		"cId": 154,
		"cName": "龙岩市",
		"Dealers": [{
			"dName": "龙岩市三峰汽车贸易有限公司"
		}]
	}]
}, {
	"pId": 19,
	"pName": "广东",
	"Cities": [{
		"cId": 155,
		"cName": "湛江市",
		"Dealers": [{
			"dName": "湛江市金富汽车销售有限公司"
		}]
	}, {
		"cId": 156,
		"cName": "云浮市",
		"Dealers": [{
			"dName": "云浮市华宇汽车销售服务有限公司"
		}]
	}, {
		"cId": 157,
		"cName": "中山市",
		"Dealers": [{
			"dName": "中山市中铃汽车销售服务有限公司"
		}, {
			"dName": "中山市华铃汽车贸易有限公司"
		}]
	}, {
		"cId": 158,
		"cName": "广州市",
		"Dealers": [{
			"dName": "广州市众赢汽车维修服务有限公司"
		}, {
			"dName": "广州泰润贸易有限公司"
		}, {
			"dName": "广州市羚锐汽车贸易有限公司  "
		}, {
			"dName": "重庆长安铃木汽车销售服务有限公司广州分公司"
		}]
	}, {
		"cId": 159,
		"cName": "清远市",
		"Dealers": [{
			"dName": "清远丰神汽车销售服务有限公司"
		}]
	}, {
		"cId": 160,
		"cName": "揭阳市",
		"Dealers": [{
			"dName": "广东欣旺贸易有限公司"
		}, {
			"dName": "揭阳市煜基实业有限公司"
		}]
	}, {
		"cId": 161,
		"cName": "韶关市",
		"Dealers": [{
			"dName": "韶关市森鑫汽车贸易有限公司"
		}]
	}, {
		"cId": 162,
		"cName": "佛山市",
		"Dealers": [{
			"dName": "佛山市路通汽车贸易有限公司"
		}, {
			"dName": "佛山市路通汽车贸易有限公司南海分公司  "
		}, {
			"dName": "佛山市顺德亚飞汽车销售有限公司"
		}]
	}, {
		"cId": 163,
		"cName": "江门市",
		"Dealers": [{
			"dName": "江门市蓬江区泰卓汽贸有限公司"
		}]
	}, {
		"cId": 164,
		"cName": "潮州市",
		"Dealers": [{
			"dName": "潮州市亿发物资汽车贸易有限公司"
		}]
	}, {
		"cId": 165,
		"cName": "惠州市",
		"Dealers": [{
			"dName": "惠州市东升汽车贸易有限公司"
		}]
	}, {
		"cId": 166,
		"cName": "深圳市",
		"Dealers": [{
			"dName": "深圳市燕兴长安汽车销售有限公司"
		}, {
			"dName": "深圳市宝爵汽车贸易有限公司"
		}]
	}, {
		"cId": 167,
		"cName": "东莞市",
		"Dealers": [{
			"dName": "东莞市羚丰汽车贸易有限公司"
		}, {
			"dName": "东莞华多利汽车有限公司"
		}]
	}, {
		"cId": 168,
		"cName": "阳江市",
		"Dealers": [{
			"dName": "阳江市立丰汽车销售有限公司"
		}]
	}, {
		"cId": 169,
		"cName": "茂名市",
		"Dealers": [{
			"dName": "茂名市亿泰汽车有限公司"
		}]
	}, {
		"cId": 170,
		"cName": "汕头市",
		"Dealers": [{
			"dName": "汕头市欣旺贸易有限公司"
		}]
	}, {
		"cId": 171,
		"cName": "珠海市",
		"Dealers": [{
			"dName": "珠海腾宇汽车销售服务有限公司"
		}]
	}, {
		"cId": 172,
		"cName": "梅州市",
		"Dealers": [{
			"dName": "梅州洁源泵业有限公司"
		}]
	}]
}, {
	"pId": 20,
	"pName": "广西",
	"Cities": [{
		"cId": 173,
		"cName": "南宁市",
		"Dealers": [{
			"dName": "广西弘晖汽车销售服务有限公司"
		}, {
			"dName": "广西恒晟汽车销售服务有限公司"
		}]
	}, {
		"cId": 174,
		"cName": "柳州市",
		"Dealers": [{
			"dName": "柳州市容达汽车销售有限公司"
		}]
	}, {
		"cId": 175,
		"cName": "贺州市",
		"Dealers": [{
			"dName": "贺州市日月机电销售有限公司"
		}]
	}, {
		"cId": 176,
		"cName": "桂林市",
		"Dealers": [{
			"dName": "桂林市福航汽车销售服务有限公司"
		}]
	}, {
		"cId": 177,
		"cName": "玉林市",
		"Dealers": [{
			"dName": "广西玉林市华维汽车销售服务有限公司"
		}]
	}, {
		"cId": 178,
		"cName": "贵港市",
		"Dealers": [{
			"dName": "贵港市华港汽车销售服务有限公司"
		}]
	}, {
		"cId": 179,
		"cName": "北海市",
		"Dealers": [{
			"dName": "广西物资集团北海机电有限公司"
		}]
	}, {
		"cId": 180,
		"cName": "钦州市",
		"Dealers": [{
			"dName": "广西恒晟汽车销售服务有限公司"
		}]
	}, {
		"cId": 181,
		"cName": "百色市",
		"Dealers": [{
			"dName": "广西南百汽车销售服务有限公司百色分公司"
		}]
	}, {
		"cId": 182,
		"cName": "梧州市",
		"Dealers": [{
			"dName": "广西梧州新田汽车贸易有限公司"
		}]
	}]
}, {
	"pId": 21,
	"pName": "海南",
	"Cities": [{
		"cId": 183,
		"cName": "海口市",
		"Dealers": [{
			"dName": "海南翔龙汽车销售服务有限公司"
		}, {
			"dName": "海口东之星铃木汽车销售服务有限公司"
		}]
	}]
}, {
	"pId": 22,
	"pName": "四川",
	"Cities": [{
		"cId": 184,
		"cName": "成都市",
		"Dealers": [{
			"dName": "成都万友经济技术开发总公司高新二分公司"
		}, {
			"dName": "成都西星汽车投资有限公司"
		}, {
			"dName": "四川铃尚汽车销售服务有限公司"
		}, {
			"dName": "四川辰安汽车销售服务有限公司"
		}]
	}, {
		"cId": 185,
		"cName": "凉山州",
		"Dealers": [{
			"dName": "西昌永兴科技有限责任公司"
		}]
	}, {
		"cId": 186,
		"cName": "攀枝花市",
		"Dealers": [{
			"dName": "攀枝花市永新商务有限责任公司"
		}]
	}, {
		"cId": 187,
		"cName": "自贡市",
		"Dealers": [{
			"dName": "自贡市四达汽车贸易有限公司"
		}]
	}, {
		"cId": 188,
		"cName": "德阳市",
		"Dealers": [{
			"dName": "德阳市华兴汽车销售服务有限公司"
		}]
	}, {
		"cId": 189,
		"cName": "广元市",
		"Dealers": [{
			"dName": "成都万友经济技术开发总公司广元分公司"
		}]
	}, {
		"cId": 190,
		"cName": "泸州市",
		"Dealers": [{
			"dName": "泸州铃里汽车销售服务有限公司"
		}]
	}, {
		"cId": 191,
		"cName": "眉山市",
		"Dealers": [{
			"dName": "眉山铃晨汽车销售服务有限公司"
		}]
	}, {
		"cId": 192,
		"cName": "达州市",
		"Dealers": [{
			"dName": "达州潘兵汽车销售有限公司"
		}, {
			"dName": "达州骏意汽车有限公司"
		}]
	}, {
		"cId": 193,
		"cName": "乐山市",
		"Dealers": [{
			"dName": "乐山红弗车业有限公司"
		}]
	}, {
		"cId": 194,
		"cName": "巴中市",
		"Dealers": [{
			"dName": "巴中市铭僖工贸有限公司"
		}]
	}, {
		"cId": 195,
		"cName": "南充市",
		"Dealers": [{
			"dName": "南充明云铃丰车业有限公司"
		}]
	}, {
		"cId": 196,
		"cName": "绵阳市",
		"Dealers": [{
			"dName": "四川波鸿实业有限公司"
		}]
	}]
}, {
	"pId": 23,
	"pName": "贵州",
	"Cities": [{
		"cId": 197,
		"cName": "贵阳市",
		"Dealers": [{
			"dName": "贵州万友汽车销售服务有限公司"
		}, {
			"dName": "贵州中企汽车销售有限公司"
		}]
	}, {
		"cId": 198,
		"cName": "黔西南州",
		"Dealers": [{
			"dName": "兴义市宏伟进口汽车维修有限公司"
		}]
	}, {
		"cId": 199,
		"cName": "遵义市",
		"Dealers": [{
			"dName": "遵义市福瑞通汽车销售有限公司"
		}]
	}]
}, {
	"pId": 24,
	"pName": "云南",
	"Cities": [{
		"cId": 200,
		"cName": "红河州",
		"Dealers": [{
			"dName": "开远市瑞丰汽车贸易有限责任公司"
		}]
	}, {
		"cId": 201,
		"cName": "昭通市",
		"Dealers": [{
			"dName": "昭通市昭阳区农业机械有限公司"
		}]
	}, {
		"cId": 202,
		"cName": "昆明市",
		"Dealers": [{
			"dName": "昆明万铃汽车销售服务有限公司"
		}, {
			"dName": "昆明万铃汽车销售服务有限公司(二店)"
		}, {
			"dName": "昆明万铃汽车销售服务有限公司（德宏店）"
		}, {
			"dName": "昆明万铃汽车销售服务有限公司（保山店）"
		}, {
			"dName": "昆明万铃汽车销售服务有限公司（临沧店）"
		}, {
			"dName": "昆明明杰汽车服务有限公司"
		}]
	}, {
		"cId": 203,
		"cName": "大理市",
		"Dealers": [{
			"dName": "大理万铃汽车销售服务有限公司"
		}]
	}, {
		"cId": 204,
		"cName": "玉溪市",
		"Dealers": [{
			"dName": "云南玉溪新世纪汽车贸易有限公司"
		}]
	}, {
		"cId": 205,
		"cName": "曲靖市",
		"Dealers": [{
			"dName": "曲靖壹众汽车经销有限公司"
		}]
	}, {
		"cId": 206,
		"cName": "楚雄市",
		"Dealers": [{
			"dName": "楚雄州机电设备有限公司"
		}]
	}]
}, {
	"pId": 25,
	"pName": "重庆",
	"Cities": [{
		"cId": 207,
		"cName": "重庆市",
		"Dealers": [{
			"dName": "重庆瑞隆汽车销售有限公司"
		}, {
			"dName": "重庆都成万禾汽车服务有限公司"
		}, {
			"dName": "重庆永川区江民汽车销售有限公司"
		}, {
			"dName": "重庆交通物资集团汇达汽车销售有限公司"
		}, {
			"dName": "重庆辰宇骏铃汽车销售服务有限公司"
		}, {
			"dName": "重庆长安铃木汽车销售服务有限公司重庆分公司"
		}, {
			"dName": "重庆长安专用汽车有限公司"
		}, {
			"dName": "重庆市涪陵区文化旅游汽车出租有限公司"
		}, {
			"dName": "重庆上驭汽车销售服务有限公司"
		}, {
			"dName": "重庆市璧元汽车销售有限公司"
		}]
	}]
}, {
	"pId": 26,
	"pName": "西藏",
	"Cities": [{
		"cId": 208,
		"cName": "拉萨市",
		"Dealers": [{
			"dName": "西藏汽车工业贸易有限责任公司"
		}]
	}]
}, {
	"pId": 27,
	"pName": "青海",
	"Cities": [{
		"cId": 209,
		"cName": "西宁市",
		"Dealers": [{
			"dName": "西宁华菱丰汽车服务有限公司"
		}]
	}]
}, {
	"pId": 28,
	"pName": "甘肃",
	"Cities": [{
		"cId": 210,
		"cName": "嘉峪关",
		"Dealers": [{
			"dName": "嘉峪关市东方冶金机电有限责任公司"
		}]
	}, {
		"cId": 211,
		"cName": "天水市",
		"Dealers": [{
			"dName": "中国重汽集团天水兰凌专用汽车有限公司"
		}]
	}, {
		"cId": 212,
		"cName": "白银市",
		"Dealers": [{
			"dName": "白银海天长铃汽车销售服务有限公司"
		}]
	}, {
		"cId": 213,
		"cName": "武威市",
		"Dealers": [{
			"dName": "武威财发工商贸有限公司"
		}]
	}, {
		"cId": 214,
		"cName": "张掖市",
		"Dealers": [{
			"dName": "张掖市海峰机电汽车贸易有限责任公司"
		}]
	}, {
		"cId": 215,
		"cName": "兰州市",
		"Dealers": [{
			"dName": "兰州翔宇汽车销售服务有限公司"
		}]
	}, {
		"cId": 216,
		"cName": "平凉市",
		"Dealers": [{
			"dName": "平凉天禾汽车销售服务有限责任公司"
		}]
	}]
}, {
	"pId": 29,
	"pName": "新疆",
	"Cities": [{
		"cId": 217,
		"cName": "昌吉州",
		"Dealers": [{
			"dName": "新疆汇展商贸有限公司"
		}]
	}, {
		"cId": 218,
		"cName": "阿克苏地区",
		"Dealers": [{
			"dName": "阿克苏笑好欣跃汽车销售服务有限公司"
		}]
	}, {
		"cId": 219,
		"cName": "和田地区",
		"Dealers": [{
			"dName": "和田市德荣商贸有限责任公司"
		}]
	}, {
		"cId": 220,
		"cName": "乌鲁木齐市",
		"Dealers": [{
			"dName": "新疆天汇笑好汽车销售有限公司"
		}, {
			"dName": "乌鲁木齐市笑好汽车销售服务有限公司"
		}]
	}, {
		"cId": 221,
		"cName": "巴音郭楞蒙古州",
		"Dealers": [{
			"dName": "新疆巴州恒瑞汽车贸易有限公司"
		}]
	}, {
		"cId": 222,
		"cName": "喀什地区",
		"Dealers": [{
			"dName": "喀什市通工实业有限公司"
		}]
	}, {
		"cId": 223,
		"cName": "石河子市",
		"Dealers": [{
			"dName": "新疆石河子市天圣杰汽车销售服务有限公司"
		}]
	}, {
		"cId": 224,
		"cName": "哈密地区",
		"Dealers": [{
			"dName": "哈密市大超汽车贸易有限责任公司"
		}]
	}, {
		"cId": 225,
		"cName": "克拉玛依市",
		"Dealers": [{
			"dName": "克拉玛依市华清汽车配件工业有限公司"
		}]
	}, {
		"cId": 226,
		"cName": "奎屯市",
		"Dealers": [{
			"dName": "奎屯泰达商贸有限责任公司"
		}]
	}]
}, {
	"pId": 30,
	"pName": "宁夏",
	"Cities": [{
		"cId": 227,
		"cName": "银川市",
		"Dealers": [{
			"dName": "宁夏康杰中佰汽车销售服务有限公司"
		}, {
			"dName": "宁夏尖峰汽车销售服务有限公司"
		}]
	}, {
		"cId": 228,
		"cName": "吴忠市",
		"Dealers": [{
			"dName": "吴忠市天翔汽车销售客运有限公司"
		}]
	}]
}, {
	"pId": 31,
	"pName": "陕西",
	"Cities": [{
		"cId": 229,
		"cName": "西安市",
		"Dealers": [{
			"dName": "陕西致华实业有限公司"
		}, {
			"dName": "陕西康源汽车服务有限公司"
		}, {
			"dName": "陕西新荣盛汽车贸易有限公司"
		}, {
			"dName": "陕西新日盛汽车贸易有限公司"
		}, {
			"dName": "陕西中顺汽车贸易有限公司"
		}]
	}, {
		"cId": 230,
		"cName": "汉中市",
		"Dealers": [{
			"dName": "汉中意通工贸有限公司"
		}]
	}, {
		"cId": 231,
		"cName": "安康市",
		"Dealers": [{
			"dName": "安康市阳光车业有限公司"
		}]
	}, {
		"cId": 232,
		"cName": "延安市",
		"Dealers": [{
			"dName": "延安兴达贸易有限责任公司"
		}]
	}, {
		"cId": 233,
		"cName": "渭南市",
		"Dealers": [{
			"dName": "渭南燕兴长安铃木汽车销售服务有限公司"
		}]
	}, {
		"cId": 234,
		"cName": "宝鸡市",
		"Dealers": [{
			"dName": "宝鸡市金盛工贸有限公司"
		}]
	}, {
		"cId": 235,
		"cName": "榆林市",
		"Dealers": [{
			"dName": "榆林市长安铃木汽车销售服务有限公司"
		}]
	}]
}]